src/spanish/spanish4/KBhMiPalabraFavorita.org
#+TITLE: Mi Palabra Favorita
#+AUTHOR: Houjun Liu
#+COURSE: SPAN401

Mi palabra favorita es posiblemente la palabra "reto". Aunque está una palabra corta, era un gran... reto para pronuncie. La frustración que circundante esta palabra es el "r", el "rrree", el trino de la sílaba primera. Cuando comencé a aprender Español, un punto particular de mi frustración fue los trinos. Practiqué mucho los trinos con una amplia gama de métodos, incluso algunos métodos raros como pegar una cucharada de mantequilla de maní en el techo de mi boca. Finalmente, logré esta hazaña por practicar un trabalenguas llena de trinos que empecé a realizar el treno. Entonces, la palabra "reto" es una marca de mi mini-éxito sobre la pronunciación de Español.

